[
  {
    "id": 1,
    "name": "Roasted goose",
    "Instructions": [
      "Preheat your oven to 350°F (175°C). Remove the giblets and excess fat from the cavity of the goose. Save the giblets for making stock or gravy. Prick the skin of the goose all over with a fork (without piercing the meat) to help release the fat during cooking. This will result in a crispier skin.",
      "Pat the goose dry with paper towels and then season generously inside and out with salt and pepper. Stuff the cavity with the quartered onion, oranges, crushed garlic, and fresh herbs.",
      "Truss the goose if desired, to help it cook evenly. This involves tying the legs together with kitchen twine and tucking the wings underneath the bird.",
      "Place the goose on a rack in a roasting pan, breast side up. Roast the goose in the preheated oven. Cooking times vary, but as a general guide, calculate about 15-20 minutes per pound (500 grams). Baste the goose occasionally with the drippings.",
      "Use a meat thermometer to ensure the goose reaches an internal temperature of 165°F (74°C) in the thickest part of the thigh without touching the bone."
    ],
    "ingredients": [
      "1 whole goose",
      "Salt and pepper",
      "1 onion quartered",
      "2-3 sprigs of fresh thyme or rosemary",
      "2-3 cloves of garlic",
      " crushed",
      "2 oranges",
      " quartered",
      "2 tablespoons melted butter or olive oil"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185692865985253437/zaicod3s_roast_goose_christmas_main_dish_8k_Ultra-HD_4dea557f-3817-4c9b-a5d7-3a06ba04335f.png?ex=65908988&is=657e1488&hm=b9fbfdda28193b7573dd36623bff4b7a97b8c64ddd805c5b4264db8548c9cdc8&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Austria"
  },
  {
    "id": 2,
    "name": "Roasted turkey",
    "Instructions": [
      "Thaw the turkey completely if it's frozen. Remove giblets and neck from the cavity. Preheat your oven to 325°F (165°C). Pat the turkey dry with paper towels.",
      "Season the cavity generously with salt and pepper. Add aromatics like quartered onion, halved lemon, garlic cloves, and herbs. Gently separate the skin from the breast meat using your fingers. Rub softened butter or olive oil underneath the skin and all over the turkey. Season the skin with salt, pepper, and herbs.",
      "Place the turkey breast side up on a roasting rack in a roasting pan. Cover the breast loosely with foil to prevent it from over-browning. Remove the foil during the last hour of cooking. Roast the turkey in the preheated oven. The cooking time will depend on the size of the turkey. As a general guide, calculate about 15 minutes per pound (500 grams). Baste the turkey every 30-45 minutes with the juices or melted butter.",
      "The turkey is done when a meat thermometer inserted into the thickest part of the thigh (without touching the bone) reads 165°F (75°C). Also, the juices should run clear when you pierce the turkey between the leg and body.",
      "Once done, remove the turkey from the oven, tent it loosely with foil, and let it rest for at least 20-30 minutes. This allows the juices to redistribute and the turkey to be more flavorful and easier to carve."
    ],
    "ingredients": [
      "1 whole turkey",
      "Salt and pepper",
      "thyme",
      " rosemary",
      " sage",
      "Butter or olive oil",
      "onion",
      " garlic",
      " lemon"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185703640426614814/zaicod3s_Roast_Turkey_8k_Ultra-HD_47d99142-b655-47db-a30c-054e8456912c.png?ex=65909391&is=657e1e91&hm=86477cf12a0adfe4d132f88b65c4ce53f04004975b2589d977dd48ef45418b86&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "United Kingdom"
  },
  {
    "id": 3,
    "name": "Arista di Maiale al Forno (Roast Pork Loin)",
    "Instructions": [
      "Preheat the oven. Rub the pork loin with minced garlic, chopped rosemary, salt, and pepper.",
      "Drizzle with olive oil. Roast in the oven until the internal temperature reaches 145°F (63°C), periodically basting with white wine. Let it rest before slicing."
    ],
    "ingredients": ["Pork loin", " garlic", " rosemary", " salt", " black pepper", " olive oil", " white wine."],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185692071135281283/zaicod3s_Arista_di_Maiale_al_Forno_Roast_Pork_Loin_8k_Ultra-HD_2ce8ab80-713b-4840-ad3f-57939b89b94f.png?ex=659088ca&is=657e13ca&hm=cacd03e4736184897c15c63ff6c8a01aa80315e04dc8deda4f3973bd4e79960f&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Italy"
  },
  {
    "id": 4,
    "name": "Carp",
    "Instructions": [
      "Preheat your oven to 375°F (190°C).",
      "Rinse the carp fillets and pat them dry with paper towels. Place them in a baking dish lined with foil or lightly greased.",
      "Drizzle the olive oil over the fish. Sprinkle minced garlic, salt, and pepper evenly on both sides of the fillets. You can also add other herbs like thyme or rosemary for additional flavor.",
      "Arrange lemon slices on top of the fillets and sprinkle chopped parsley over them.",
      "Cover the baking dish with foil and place it in the preheated oven. Bake for about 20-25 minutes or until the fish flakes easily with a fork. Cooking time may vary based on the thickness of the fillets."
    ],
    "ingredients": [
      "2-3 pounds carp fillets",
      "2 tablespoons olive oil",
      "2 cloves garlic minced",
      "1 lemon",
      "1 tablespoon fresh parsley",
      "Salt and pepper",
      "herbs"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185697187498295417/zaicod3s_Carp_fish_Christmas_dish_8k_Ultra-HD_ac2ed5bb-5362-42a2-b8fe-660d78d8c315.png?ex=65908d8e&is=657e188e&hm=17c5947439183bf15a2f0df590de9214752c836e470ca37b30bceefc40f32c42&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Czech Republic"
  },
  {
    "id": 5,
    "name": "Roast Duck",
    "Instructions": [
      "Preheat your oven to 350°F (175°C). Remove the giblets from the duck's cavity and pat the duck dry with paper towels. Score the duck's skin in a crisscross pattern (be careful not to cut into the meat) to help the fat render during roasting. Season the duck generously with salt and pepper, both inside and outside.",
      "If desired, stuff the cavity of the duck with quartered oranges or lemon slices and fresh herbs like thyme, rosemary, or sage. This adds flavor and aroma to the duck.",
      "Place the duck on a rack in a roasting pan, breast side up. If you have a roasting thermometer, insert it into the thickest part of the duck's thigh, making sure it doesn't touch bone.",
      "The duck is done when a meat thermometer inserted into the thigh reads around 165°F (74°C). Ensure the juices run clear when pierced between the leg and body.",
      "Once done, remove the duck from the oven and let it rest for 10-15 minutes before carving."
    ],
    "ingredients": ["1 whole duck", "Salt and pepper", "2 oranges or 1 lemon quartered", "Fresh herbs"],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185707997767401552/zaicod3s_Danish_Roasted_duck_8k_Ultra-HD_6fa781a1-408e-4872-a61b-463c6be45426.png?ex=659097a0&is=657e22a0&hm=021fb6ca735acdbebab2afb05af96faf951fa5dc8a88823989b3f1728d595e38&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Denmark"
  },
  {
    "id": 6,
    "name": "Suckling Pig",
    "Instructions": [
      "Ensure the pig is thoroughly cleaned and patted dry with paper towels. Remove any excess hair using a kitchen torch or by carefully shaving it off. Rinse the pig inside and out with cold water. Using a sharp knife, score the skin of the pig in a crosshatch pattern, making sure not to cut too deeply into the meat.",
      "Rub the pig generously with salt and freshly ground black pepper, both inside the cavity and all over the outside skin. You can also drizzle some olive oil or melted butter to help crisp the skin during roasting. Use kitchen twine to tie the legs and secure the pig's shape. This helps the pig cook evenly and holds it together during roasting.",
      "Preheat your oven to a high temperature, around 450°F (230°C).",
      "Place the pig on a roasting rack in a large roasting pan. Start roasting the pig at the high temperature for about 30 minutes to help crisp the skin. Then, reduce the oven temperature to 325°F (160°C) and continue roasting.",
      "Cooking time varies based on the size of the pig. A general guideline is about 30-40 minutes per pound. Use a meat thermometer to ensure the internal temperature reaches 160°F (71°C) in the thickest part of the meat. Once done, remove the pig from the oven and let it rest for about 20-30 minutes before carving."
    ],
    "ingredients": ["1 suckling pig", "Salt", "Freshly ground black pepper", "Olive oil or melted butter", "Herbs"],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185711525818814594/zaicod3s_roasted_Suckling_pig_dish_Ultra-HD_8d045646-d617-4ebb-bef4-e46a4417a543.png?ex=65909ae9&is=657e25e9&hm=a15a6a274b9be2a04e49d130a504aec36dadd41e1c83c5883a60860d121de8ba&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Germany"
  },
  {
    "id": 7,
    "name": "Glazed Ham",
    "Instructions": [
      "Preheat your oven to 325°F (165°C).",
      "Prepare the ham by scoring the surface lightly in a diamond pattern with a sharp knife. If desired, insert whole cloves into the scored intersections for added flavor and decoration. Place the ham on a roasting pan lined with foil or parchment paper, cut side down.",
      "In a bowl, mix together the brown sugar, honey or maple syrup, Dijon mustard, apple cider vinegar, ground cloves, cinnamon, and nutmeg to create the glaze.",
      "Brush a generous amount of the glaze all over the surface of the ham, ensuring it gets into the cuts and crevices. Cover the ham loosely with foil to prevent excessive browning and place it in the preheated oven. Bake the ham for about 15-20 minutes per pound, or until the internal temperature reaches 140°F (60°C). Baste the ham with the glaze every 30 minutes or so while it cooks.",
      "During the last 15-20 minutes of cooking, remove the foil to allow the glaze to caramelize and form a nice crust. Once the ham is fully cooked and has reached the desired internal temperature, remove it from the oven and let it rest for about 15-20 minutes before slicing."
    ],
    "ingredients": [
      "1 fully cooked bone-in ham (8-10 pounds)",
      "Whole cloves",
      "1 cup brown sugar",
      "1/2 cup honey or maple syrup",
      "1/4 cup Dijon mustard",
      "2 tablespoons apple cider vinegar",
      "1 teaspoon ground cloves",
      "1 teaspoon ground cinnamon",
      "1/2 teaspoon ground nutmeg"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185703229317730445/zaicod3s_Irish_Glazed_Ham_8k_Ultra-HD_f3dbede2-045e-405f-b80b-35583442b2e3.png?ex=6590932f&is=657e1e2f&hm=8d12bbc985d9c81fa98f8507dab210d6653ec2be12b0dceab0c88d8242b25dcf&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Ireland"
  },
  {
    "id": 8,
    "name": "Capon",
    "Instructions": [
      "Preheat your oven to 350°F (175°C). Rinse the capon thoroughly under cold water and pat it dry with paper towels. Remove any giblets or innards from the cavity if they are included. Rub the inside of the capón with the cut sides of the lemon. Season the inside cavity generously with salt, pepper, and your choice of herbs.",
      "In a small bowl, mix the softened butter with minced garlic. Season the outside of the capón with salt and pepper, and then rub the butter and garlic mixture all over the bird, ensuring even coverage. Place the quartered onion, carrots, and celery in the bottom of a roasting pan to create a bed for the capón. This will help elevate the bird and add flavor to the drippings.",
      "Truss the capón if desired, then place it breast side up on top of the vegetables in the roasting pan. Pour the chicken broth or white wine into the bottom of the roasting pan to provide moisture during cooking. This will also be used for basting.",
      "Place the roasting pan in the preheated oven and roast the capón. Baste the bird occasionally with the pan juices to keep it moist. Roast the capón for approximately 20 minutes per pound, but use a meat thermometer to ensure the internal temperature reaches at least 165°F (74°C) in the thickest part of the bird.",
      "Once cooked, remove the capón from the oven and let it rest for about 15-20 minutes before carving. Serve the capón with the roasted vegetables and the flavorful pan juices as a delicious and festive centerpiece for your meal."
    ],
    "ingredients": [
      "1 capon (approximately 8-10 pounds)",
      "1 lemon",
      "Salt and pepper",
      "Herbs for seasoning",
      "4-6 tablespoons butter softened",
      "4-6 garlic cloves",
      " minced",
      "1 onion",
      " quartered",
      "2-3 carrots",
      " cut into chunks",
      "2-3 stalks of celery",
      " cut into chunks",
      "1 cup chicken broth or white wine"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185712455410782268/zaicod3s_Spanish_Capon_dish_Capon_Ultra-HD_ceb19d23-61da-4b36-9e63-41e37d42c8e6.png?ex=65909bc6&is=657e26c6&hm=9edca5fc8ffbb208c5842a2a598cd1f45268c97997c0e8065fb68087c6491dc3&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Spain"
  },
  {
    "id": 9,
    "name": "Fish",
    "Instructions": [
      "Rinse the salmon fillet under cold water and pat it dry with paper towels. In a bowl, mix together the sea salt, sugar, crushed black peppercorns, chopped fresh dill.",
      "Lay out a piece of plastic wrap longer than the salmon fillet. Spread half of the salt-sugar mixture evenly over the plastic wrap. Place the salmon fillet, skin-side down, on top of the salt-sugar mixture.",
      "Spread the remaining salt-sugar mixture evenly over the top of the salmon fillet, ensuring it's completely covered. Wrap the salmon tightly in the plastic wrap, then place it in a shallow dish or on a tray. Place a weight on top of the wrapped salmon (such as a plate with some cans on top) to press it down.",
      "Refrigerate the salmon for 2-3 days, flipping it once a day. The longer it cures, the firmer the texture will be. After curing, unwrap the salmon and gently scrape off the excess salt-sugar mixture. Slice the Graavilohi thinly at an angle, cutting away from the skin. Garnish the slices with fresh dill and serve."
    ],
    "ingredients": [
      "1 lb (about 450g) salmon fillet skin-on",
      "2 tablespoons sea salt",
      "2 tablespoons sugar",
      "1 tablespoon crushed black peppercorns",
      "1 tablespoon fresh dill chopped"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185699594504511488/zaicod3s_Finnish_Christmas_Fish_dish_8k_Ultra-HD_7d7c9c25-03de-4ef1-92a1-aa802a56baf0.png?ex=65908fcc&is=657e1acc&hm=747d1e2e003eb5ef241d3f52a76515a6d32078580f8f029d13d4f115592784ea&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Finland"
  },
  {
    "id": 10,
    "name": "Oysters",
    "Instructions": [
      "Rinse the oysters under cold running water to remove any dirt or debris. Use a stiff brush to scrub the shells if needed. Place the oysters on a tray or platter, making sure they sit level and won't spill the juices.",
      "With a clean oyster knife, carefully shuck each oyster by inserting the knife into the hinge of the shell. Twist the knife to pop the shell open, then slide it along the inside to cut the muscle attaching the oyster to the shell. Remove the top shell and loosen the oyster from the bottom shell, keeping it in its juices."
    ],
    "ingredients": ["Fresh oysters on the half shell (as many as desired)", "Lemon wedges"],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185701300306976868/zaicod3s_French_Oysters_dish_8k_Ultra-HD_bb179ed1-efdc-403b-920f-dbeb168d3f35.png?ex=65909163&is=657e1c63&hm=3e61fd64ea69d9d798090a48e07b0567c049ea9cb96a26f0732c4be3ddfd0824&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "France"
  },
  {
    "id": 11,
    "name": "Rabanadas",
    "Instructions": [
      "Cut the day-old bread into thick slices, about 3/4 to 1 inch thick. Set them aside.",
      "In a saucepan, combine the milk, lemon zest, orange zest, and cinnamon stick (or ground cinnamon). Heat the mixture over low heat, stirring occasionally, until it's warm but not boiling. Remove from heat and let it cool slightly.",
      "In a shallow dish or bowl, whisk the eggs together. Dip each slice of bread into the warm milk mixture, allowing it to soak for a few seconds on each side. Ensure the bread is soaked but not overly saturated.",
      "Heat vegetable oil or melt butter in a frying pan over medium heat. Fry the soaked bread slices in the hot oil or butter until they're golden brown and crispy on both sides. This usually takes about 2-3 minutes per side. Cook in batches, if needed, to avoid overcrowding the pan.",
      "Once cooked, remove the Rabanadas from the pan and drain them on paper towels to absorb any excess oil.",
      "In a separate shallow dish, combine the granulated sugar with a little ground cinnamon. While the Rabanadas are still warm, coat them in the cinnamon sugar mixture, ensuring they're evenly coated on both sides. Arrange the Rabanadas on a serving platter and dust them with a bit more cinnamon powder for extra flavor."
    ],
    "ingredients": [
      "1 loaf of day-old bread",
      "2 cups whole milk",
      "4 large eggs",
      "Zest of 1 lemon",
      "Zest of 1 orange",
      "1 cinnamon stick or 1 teaspoon ground cinnamon",
      "1 cup granulated sugar",
      "Vegetable oil"
    ],
    "image_url": "no_image",
    "country": "Portugal"
  },
  {
    "id": 12,
    "name": "Garides Saganaki",
    "Instructions": [
      "Preheat the oven to 375°F (190°C).",
      "Heat olive oil in an oven-safe skillet over medium heat. Add the chopped onion and sauté until translucent. Add the minced garlic and cook for another minute until fragrant. Stir in the diced tomatoes, tomato sauce, dried oregano, paprika, salt, and pepper. Simmer the sauce for about 10-15 minutes until it thickens slightly. Add the cleaned shrimp to the skillet and cook for about 3-4 minutes until they turn pink and opaque. Stir occasionally to coat the shrimp in the sauce.",
      "Sprinkle the crumbled feta cheese over the shrimp and sauce in the skillet. Transfer the skillet to the preheated oven and bake for approximately 10-12 minutes or until the feta cheese melts and starts to turn golden.",
      "Remove the skillet from the oven. Garnish the Garides Saganaki with chopped fresh parsley."
    ],
    "ingredients": [
      "1 lb (450g) large shrimp",
      " peeled and deveined",
      "2 tablespoons olive oil",
      "1 onion finely chopped",
      "3-4 garlic cloves minced",
      "1 can (14 oz/400g) diced tomatoes",
      "1/2 cup tomato sauce or passata",
      "1 teaspoon dried oregano",
      "1 teaspoon paprika",
      "Salt and pepper to taste",
      "1/2 cup crumbled feta cheese",
      "Chopped fresh parsley"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185696723419541536/zaicod3s_Garides_Saganaki_shrimp_8k_Ultra-HD_9fe8109c-f3c3-45d4-b463-748173f63a9a.png?ex=65908d20&is=657e1820&hm=ae51603061e5d0f70fdc214269739d542127bcaf9660d7a9c56f36eba37a278c&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Greece"
  },
  {
    "id": 13,
    "name": "Wild Game",
    "Instructions": [
      "Pat the venison steaks dry with paper towels. Season both sides generously with salt and black pepper.",
      "Heat a heavy-bottomed skillet or cast-iron pan over medium-high heat. Add the olive oil or clarified butter and let it heat until shimmering but not smoking.",
      "Carefully place the venison steaks in the hot pan. Let them sear without moving for about 2-3 minutes to develop a nice crust. Flip the steaks and sear for an additional 2-3 minutes for medium-rare doneness (adjust timing based on preferred doneness).",
      "In the last minute of cooking, add minced garlic and fresh herbs to the pan, letting them infuse the oil or butter. Using a spoon, baste the steaks with the flavored oil or butter.",
      "Once cooked to your desired doneness, remove the venison steaks from the pan and let them rest on a plate loosely covered with foil for about 5-10 minutes. This allows the juices to redistribute and keeps the steaks juicy."
    ],
    "ingredients": [
      "4 venison steaks (about 6-8 oz each) brought to room temperature",
      "Salt and black pepper",
      "2 tablespoons olive oil",
      "2-3 cloves garlic minced",
      "Fresh herbs"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185693320865919037/zaicod3s_Wild_Game_christmas_dish_8k_Ultra-HD_776dfcc5-29e6-4082-a81f-490820c5f56c.png?ex=659089f4&is=657e14f4&hm=7f5b9ffb9ec2c6d432725c86e238fdbf7583bf72bef3b0ef5b800450496a1ff4&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Netherlands"
  },
  {
    "id": 14,
    "name": "Cepelinai ",
    "Instructions": [
      "Mix the grated potatoes with the squeezed raw grated potatoes. Add salt, flour, and egg. Mix well until you get a consistent dough.",
      "In a bowl, combine the ground meat with finely chopped onions. Add salt and pepper to taste, mix well.",
      "Take a handful of the potato dough and flatten it in your palm to form a small disc. Place a spoonful of the meat filling in the center of the disc. Fold the potato dough over the filling, shaping it into an elongated shape resembling a zeppelin or dumpling. Make sure the filling is completely covered and seal the edges well.",
      "Bring a large pot of salted water to a boil. Gently place the formed Cepelinai into the boiling water. Reduce the heat to medium-low to maintain a gentle boil and cook the Cepelinai for about 20-25 minutes or until they float to the surface.",
      "Remove the cooked Cepelinai with a slotted spoon and drain them. Serve hot, topped with a dollop of sour cream. Some people also like to sprinkle crispy bacon on top or add a pat of butter."
    ],
    "ingredients": [
      "6 large potatoes (about 2 1/2 pounds)",
      " peeled and grated",
      " 2 cups of raw grated potatoes (squeezed to remove excess liquid)",
      " 1 teaspoon salt",
      " 2 tablespoons all-purpose flour",
      " 1 egg",
      " 1 pound ground pork or a mixture of pork and beef",
      " 1 onion (finely chopped)",
      " salt and pepper to taste",
      " sour cream",
      " crumbled crispy bacon (optional)",
      " butter (optional).       "
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185695630262272091/chaosas_Large_potato_dumplings_stuffed_with_minced_meat_or_cott_818a7349-e558-4912-b913-75f294b8b931.png?ex=65908c1b&is=657e171b&hm=6f737043c306ecadfdadeb255a1b65a457726efe1d0d11387591dd5844f4ccf7&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Lithuania"
  },
  {
    "id": 15,
    "name": "Certainly",
    "Instructions": [
      "In a large mixing bowl, combine the ground meat with finely chopped onion, minced garlic, sweet paprika, salt, black pepper, and baking soda. Mix the ingredients thoroughly until well combined. You can use your hands, but avoid overworking the mixture to prevent toughness in the Ćevapi.",
      "Take a small amount of the meat mixture and shape it into sausage-like cylinders, about 3-4 inches long and 1 inch in diameter. Wetting your hands with a little water or oil can help prevent sticking while shaping.",
      "Preheat your grill or barbecue to medium-high heat. If the mixture feels too soft or doesn’t hold its shape well, refrigerate it for 30 minutes before shaping the Ćevapi again. Lightly oil the grill grates or brush the Ćevapi with oil to prevent sticking. Grill the Ćevapi for about 5-7 minutes, turning occasionally, until they are cooked through and have a nice char on the outside.",
      "Serve the Ćevapi hot with flatbread such as somun or lepinja, along with chopped onions, ajvar (red pepper-based condiment), kajmak (dairy spread), sour cream, or other preferred condiments."
    ],
    "ingredients": [
      "1 pound ground beef (you can also use a mixture of beef",
      " pork",
      " and lamb)",
      " 1 small onion finely chopped",
      " 2 cloves garlic minced",
      " 1 teaspoon sweet paprika",
      " 1 teaspoon salt",
      " 1/2 teaspoon black pepper",
      " 1/2 teaspoon baking soda",
      " 1 tablespoon vegetable oil (optional for greasing hands and grill)"
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185698175433068604/chaosas_delicious_grilled_minced_meat_sausages_served_with_flat_fca1c19a-d17a-40d1-9639-2d8a12835d0e.png?ex=65908e7a&is=657e197a&hm=015ad649bb6649bb4c6ef342e01e907591b52d5f7c4f503d11c84c6cee5c591a&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Croatia"
  },
  {
    "id": 16,
    "name": "Żurek",
    "Instructions": [
      "If using a sourdough starter, mix it with a cup of lukewarm water and set it aside for about 6-8 hours or overnight to ferment. If you have żurek, use it directly.",
      "In a large pot, bring the water or meat broth to a boil. Add the sausage or ham slices, chopped onion, minced garlic, bay leaf, and allspice berries. Simmer for about 30 minutes to allow the flavors to meld.",
      "If using a sourdough starter, strain the mixture, discarding any solids, and add the liquid to the pot. If using żurek, add it directly to the pot.",
      "Add the diced potatoes to the pot and simmer until they are tender, usually for about 15-20 minutes.",
      "In a separate bowl, whisk the sour cream until smooth. Gradually add a ladleful of hot soup to the sour cream while continuously whisking to temper it. This prevents the sour cream from curdling when added to the hot soup. Pour the sour cream mixture back into the pot, stirring well to combine. Season the soup with salt and pepper to taste.",
      "Ladle the Żurek into bowls and garnish each serving with slices of hard-boiled egg and chopped fresh parsley or dill."
    ],
    "ingredients": [
      "1 cup sourdough starter or żurek (fermented rye flour starter)",
      " 6 cups water or meat broth",
      " 1 pound Polish sausage (kielbasa) or ham",
      " sliced",
      " 1 onion",
      " finely chopped",
      " 2-3 cloves garlic",
      " minced",
      " 1 bay leaf",
      " 5-6 whole allspice berries",
      " 2 medium potatoes",
      " diced",
      " 2 hard-boiled eggs",
      " sliced",
      " 1 cup sour cream",
      " Salt and pepper to taste",
      " Chopped fresh parsley or dill for garnish."
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185705046197928076/chaosas_Zurek_A_sour_rye_soup_with_sausage_potatoes_and_hard-bo_5c49c610-24b6-4a5d-b90c-d96dc8dc9629.png?ex=659094e0&is=657e1fe0&hm=11ff528376107ba137565834bc4b6c646e1bf40842550a83c66b0fe9609f936c&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Poland"
  },
  {
    "id": 17,
    "name": "Ghiveci",
    "Instructions": [
      "Wash and dice the eggplants, tomatoes, bell peppers, carrots, potatoes, and green beans.",
      "In a large pot or Dutch oven, heat olive oil over medium heat. Add the chopped onions and sauté until translucent. Add the minced garlic and continue cooking for another minute until fragrant.",
      "Add the diced eggplants, tomatoes, bell peppers, carrots, potatoes, and green beans to the pot. Stir the vegetables together and cook for a few minutes until they begin to soften.",
      "Mix in the tomato paste, distributing it evenly among the vegetables. Pour in the vegetable or chicken broth, season with salt and pepper to taste, and stir well. Cover the pot and simmer over low to medium heat for about 30-40 minutes or until all the vegetables are tender, stirring occasionally.",
      "Once the Ghiveci is cooked, remove it from heat. Garnish with fresh herbs like parsley or dill if desired. Serve the Ghiveci warm as a main dish or as a side accompaniment."
    ],
    "ingredients": [
      " medium-sized eggplants",
      " diced",
      " 2-3 tomatoes",
      " diced",
      " 2 bell peppers (red",
      " green",
      " or yellow)",
      " chopped",
      " 2 medium-sized onions",
      " finely chopped",
      " 2 carrots",
      " diced",
      " 2-3 potatoes",
      " diced",
      " 2-3 cloves garlic",
      " minced",
      " 1 cup green beans",
      " chopped",
      " 2 tablespoons tomato paste",
      " 2 cups vegetable or chicken broth",
      " 2 tablespoons olive oil",
      " Salt and pepper to taste",
      " Fresh herbs (parsley",
      " dill) for garnish (optional)."
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185707046893518889/chaosas_Ghiveci_A_vegetable_stew_made_with_eggplant_tomatoes_be_e7806a87-b1ae-469a-9513-13b1885ae51e.png?ex=659096bd&is=657e21bd&hm=766f23ec3041c368bf11f4c88d0b7e4f4fc25858674a5fd95317e4ee37842098&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Romania"
  },
  {
    "id": 18,
    "name": "Moules-Frites",
    "Instructions": [
      "Ensure all the mussels are cleaned and debearded. Discard any open or broken ones.",
      "In a large pot or Dutch oven, heat a drizzle of olive oil or a knob of butter over medium heat. Add the chopped shallots and minced garlic, sauté until softened but not browned.",
      "Increase the heat to high and add the cleaned mussels to the pot. Pour in the white wine, cover the pot, and let the mussels steam for about 5-7 minutes or until they open. Discard any mussels that remain closed.",
      "Season the mussels with salt and pepper to taste. Sprinkle freshly chopped parsley over the mussels.",
      "Rinse the peeled potatoes and dry them thoroughly. Cut them into thick fries or wedges. Heat vegetable oil in a deep fryer or a large pot to around 325-350°F (165-175°C). Fry the potatoes in batches until they are golden and crispy, usually for about 4-5 minutes per batch.",
      "Remove the fries from the oil and let them drain on paper towels. Season the fries with salt while they're still hot."
    ],
    "ingredients": [
      "2 kg (4.4 lbs) fresh mussels",
      " cleaned and debearded",
      " 2 shallots",
      " finely chopped",
      " 2 cloves garlic",
      " minced",
      " 1 cup dry white wine",
      " A handful of fresh parsley",
      " chopped",
      " Salt and pepper to taste",
      " Olive oil or butter for cooking",
      " 4 large potatoes (Russet or Bintje)",
      " peeled and cut into fries",
      " Vegetable oil for frying",
      " Salt to taste."
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185711745231245322/chaosas_Steamed_mussels_cooked_in_a_variety_of_broths_often_fla_a4c8d580-65bf-44d9-9378-4a7765ee0041.png?ex=65909b1d&is=657e261d&hm=f97e99c42fcd78ca1ae82492171b0cc4511307974220161e7976eb7920fb6523&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Belgium"
  },
  {
    "id": 19,
    "name": "Hangikjöt",
    "Instructions": [
      "If the smoked lamb is not pre-sliced, thinly slice it. Remove any excess fat if desired.",
      "Peel the potatoes and cut them into chunks. Boil them in salted water until they're tender. Drain and set aside.",
      "If using fresh peas, blanch them in boiling water for a few minutes until they're tender but still crisp. If using frozen peas, cook them according to package instructions. Drain and set aside.",
      "Prepare béchamel sauce by melting butter in a saucepan, adding flour to create a roux, and then slowly adding milk while stirring constantly until the sauce thickens. Season it with salt and pepper.",
      "Arrange the sliced smoked lamb on a plate. Place the boiled potatoes and cooked peas around the lamb. Pour béchamel sauce over the potatoes and peas. Optionally, you can add a dollop of butter on top.",
      "Hangikjöt is typically served warm, allowing the flavors to blend. Enjoy this Icelandic smoked lamb dish with the creamy béchamel sauce, potatoes, and peas."
    ],
    "ingredients": ["Smoked lamb", " potatoes", " peas", " béchamel sauce", " butter", " salt", " pepper."],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185713364945608764/chaosas_Smoked_lamb_served_thinly_sliced_as_a_cold_cut_with_pot_3d39cde9-923b-4115-84de-75f889f27157.png?ex=65909c9f&is=657e279f&hm=e2849e70afeb5963feef1360e0dec8ada7891e1abd24a5ee3be6c22baf0d024c&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Iceland"
  },
  {
    "id": 20,
    "name": "Pastizz",
    "Instructions": [
      "In a mixing bowl, combine 4 cups of all-purpose flour and 1 teaspoon of salt. Cut in the chilled and diced 1 cup of butter until the mixture resembles breadcrumbs. Gradually add 1 cup of cold water while stirring until a dough forms. Knead the dough gently for a few minutes until smooth. Wrap the dough in plastic wrap and refrigerate for at least 30 minutes.",
      "For the ricotta filling, mix 2 cups of ricotta cheese with salt and pepper to taste in a bowl. Set it aside.",
      "For the pea filling, if using whole peas, cook and mash them. Mix with sautéed onions (if using), salt, and pepper. Set aside.",
      "Preheat your oven to 200°C (400°F). On a floured surface, roll out the chilled dough thinly. Cut the dough into small rounds or squares (about 3-4 inches in diameter). Place a small spoonful of the desired filling (ricotta or pea) in the center of each pastry round or square. Fold the pastry over the filling to create a triangular or rectangular shape, crimping the edges tightly to seal.",
      "Beat an egg and brush the pastries with the egg wash. This will give the pastizzi a golden-brown color when baked.",
      "Place the pastizzi on a baking tray lined with parchment paper and bake in the preheated oven for about 20-25 minutes or until golden brown and crispy. Enjoy the freshly baked pastizzi tal-irkotta or pastizzi tal-piżelli as a delightful snack or appetizer."
    ],
    "ingredients": [
      "4 cups all-purpose flour",
      " 1 teaspoon salt",
      " 1 cup butter (chilled and diced)",
      " 1 cup cold water",
      " 2 cups ricotta cheese",
      " Salt and pepper to taste",
      " 1 egg (for brushing)",
      " 2 cups mushy peas (or cooked and mashed green peas)",
      " 1 onion (finely chopped and sautéed - optional)",
      " 1 egg (for brushing)."
    ],
    "image_url": "https://media.discordapp.net/attachments/941582479117127680/1185717444661227730/chaosas_Flaky_pastries_filled_with_ricotta_cheese_pastizzi_tal-_6bff3568-da67-447b-a041-0de8edb925f6.png?ex=6590a06c&is=657e2b6c&hm=a2477e4af3d5e615ba4959da35f66970477246fff58f7b2c97cc4adc6ec56b08&=&format=webp&quality=lossless&width=1197&height=671",
    "country": "Malta"
  },
  {
    "id": 21,
    "name": "Köttbullar",
    "Instructions": [
      "To make Köttbullar, combine ground beef, soaked breadcrumbs, chopped onion, and an egg; season with salt and pepper, shape into small meatballs, and cook in butter or oil until browned, then serve with lingonberry sauce and potatoes or mashed potatoes."
    ],
    "ingredients": [
      "ground beef",
      " soaked breadcrumbs",
      " chopped onion",
      " egg",
      " salt",
      " pepper",
      " and lingonberry sauce",
      " served with potatoes or mashed potatoes."
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185721137611690134/zaicod3s_Kottbullar_dish_Ultra-HD_d02a8c44-5d54-43b1-b454-5c028fc038bb.png?ex=6590a3dc&is=657e2edc&hm=dc008a0b87191f3e9c20d6748c58532faca2af6cbc8ce363d435d798345f681d&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Sweden"
  },
  {
    "id": 22,
    "name": "name22",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country22"
  },
  {
    "id": 23,
    "name": "name23",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country23"
  },
  {
    "id": 24,
    "name": "name24",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country24"
  },
  {
    "id": 25,
    "name": "name25",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country25"
  },
  {
    "id": 26,
    "name": "name26",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country26"
  },
  {
    "id": 27,
    "name": "name27",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country27"
  },
  {
    "id": 28,
    "name": "name28",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country28"
  },
  {
    "id": 29,
    "name": "name29",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country29"
  },
  {
    "id": 30,
    "name": "name30",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country30"
  },
  {
    "id": 31,
    "name": "name31",
    "Instructions": [
      "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
    ],
    "ingredients": ["ingredient 1", "ingredient 2", "ingredient 3"],
    "image_url": "no_image",
    "country": "country31"
  }
]
