[
  {
    "id": 1,
    "name": "Roasted goose",
    "instructions": [
      "Preheat your oven to 350°F (175°C). Remove the giblets and excess fat from the cavity of the goose. Save the giblets for making stock or gravy. Prick the skin of the goose all over with a fork (without piercing the meat) to help release the fat during cooking. This will result in a crispier skin.",
      "Pat the goose dry with paper towels and then season generously inside and out with salt and pepper. Stuff the cavity with the quartered onion, oranges, crushed garlic, and fresh herbs.",
      "Truss the goose if desired, to help it cook evenly. This involves tying the legs together with kitchen twine and tucking the wings underneath the bird.",
      "Place the goose on a rack in a roasting pan, breast side up. Roast the goose in the preheated oven. Cooking times vary, but as a general guide, calculate about 15-20 minutes per pound (500 grams). Baste the goose occasionally with the drippings.",
      "Use a meat thermometer to ensure the goose reaches an internal temperature of 165°F (74°C) in the thickest part of the thigh without touching the bone."
    ],
    "ingredients": [
      "1 whole goose",
      "Salt and pepper",
      "1 onion quartered",
      "2-3 sprigs of fresh thyme or rosemary",
      "2-3 cloves of garlic, crushed",
      "2 oranges quartered",
      "2 tablespoons melted butter or olive oil"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185692865985253437/zaicod3s_roast_goose_christmas_main_dish_8k_Ultra-HD_4dea557f-3817-4c9b-a5d7-3a06ba04335f.png?ex=65908988&is=657e1488&hm=b9fbfdda28193b7573dd36623bff4b7a97b8c64ddd805c5b4264db8548c9cdc8&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Austria"
  },
  {
    "id": 2,
    "name": "Roasted turkey",
    "instructions": [
      "Thaw the turkey completely if it's frozen. Remove giblets and neck from the cavity. Preheat your oven to 325°F (165°C). Pat the turkey dry with paper towels.",
      "Season the cavity generously with salt and pepper. Add aromatics like quartered onion, halved lemon, garlic cloves, and herbs. Gently separate the skin from the breast meat using your fingers. Rub softened butter or olive oil underneath the skin and all over the turkey. Season the skin with salt, pepper, and herbs.",
      "Place the turkey breast side up on a roasting rack in a roasting pan. Cover the breast loosely with foil to prevent it from over-browning. Remove the foil during the last hour of cooking. Roast the turkey in the preheated oven. The cooking time will depend on the size of the turkey. As a general guide, calculate about 15 minutes per pound (500 grams). Baste the turkey every 30-45 minutes with the juices or melted butter.",
      "The turkey is done when a meat thermometer inserted into the thickest part of the thigh (without touching the bone) reads 165°F (75°C). Also, the juices should run clear when you pierce the turkey between the leg and body.",
      "Once done, remove the turkey from the oven, tent it loosely with foil, and let it rest for at least 20-30 minutes. This allows the juices to redistribute and the turkey to be more flavorful and easier to carve."
    ],
    "ingredients": [
      "1 whole turkey",
      "Salt and pepper",
      "thyme",
      "rosemary",
      "sage",
      "Butter or olive oil",
      "onion",
      "garlic",
      "lemon"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185703640426614814/zaicod3s_Roast_Turkey_8k_Ultra-HD_47d99142-b655-47db-a30c-054e8456912c.png?ex=65909391&is=657e1e91&hm=86477cf12a0adfe4d132f88b65c4ce53f04004975b2589d977dd48ef45418b86&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "United Kingdom"
  },
  {
    "id": 3,
    "name": "Arista di Maiale al Forno (Roast Pork Loin)",
    "instructions": [
      "Preheat the oven. Rub the pork loin with minced garlic, chopped rosemary, salt, and pepper.",
      "Drizzle with olive oil. Roast in the oven until the internal temperature reaches 145°F (63°C), periodically basting with white wine. Let it rest before slicing."
    ],
    "ingredients": [
      "Pork loin",
      "garlic",
      "rosemary",
      "salt",
      "black pepper",
      "olive oil",
      "white wine."
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185692071135281283/zaicod3s_Arista_di_Maiale_al_Forno_Roast_Pork_Loin_8k_Ultra-HD_2ce8ab80-713b-4840-ad3f-57939b89b94f.png?ex=659088ca&is=657e13ca&hm=cacd03e4736184897c15c63ff6c8a01aa80315e04dc8deda4f3973bd4e79960f&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Italy"
  },
  {
    "id": 4,
    "name": "Carp",
    "instructions": [
      "Preheat your oven to 375°F (190°C).",
      "Rinse the carp fillets and pat them dry with paper towels. Place them in a baking dish lined with foil or lightly greased.",
      "Drizzle the olive oil over the fish. Sprinkle minced garlic, salt, and pepper evenly on both sides of the fillets. You can also add other herbs like thyme or rosemary for additional flavor.",
      "Arrange lemon slices on top of the fillets and sprinkle chopped parsley over them.",
      "Cover the baking dish with foil and place it in the preheated oven. Bake for about 20-25 minutes or until the fish flakes easily with a fork. Cooking time may vary based on the thickness of the fillets."
    ],
    "ingredients": [
      "2-3 pounds carp fillets",
      "2 tablespoons olive oil",
      "2 cloves garlic minced",
      "1 lemon",
      "1 tablespoon fresh parsley",
      "Salt and pepper",
      "herbs"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185697187498295417/zaicod3s_Carp_fish_Christmas_dish_8k_Ultra-HD_ac2ed5bb-5362-42a2-b8fe-660d78d8c315.png?ex=65908d8e&is=657e188e&hm=17c5947439183bf15a2f0df590de9214752c836e470ca37b30bceefc40f32c42&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Czech Republic"
  },
  {
    "id": 5,
    "name": "Roast Duck",
    "instructions": [
      "Preheat your oven to 350°F (175°C). Remove the giblets from the duck's cavity and pat the duck dry with paper towels. Score the duck's skin in a crisscross pattern (be careful not to cut into the meat) to help the fat render during roasting. Season the duck generously with salt and pepper, both inside and outside.",
      "If desired, stuff the cavity of the duck with quartered oranges or lemon slices and fresh herbs like thyme, rosemary, or sage. This adds flavor and aroma to the duck.",
      "Place the duck on a rack in a roasting pan, breast side up. If you have a roasting thermometer, insert it into the thickest part of the duck's thigh, making sure it doesn't touch bone.",
      "The duck is done when a meat thermometer inserted into the thigh reads around 165°F (74°C). Ensure the juices run clear when pierced between the leg and body.",
      "Once done, remove the duck from the oven and let it rest for 10-15 minutes before carving."
    ],
    "ingredients": [
      "1 whole duck",
      "Salt and pepper",
      "2 oranges or 1 lemon quartered",
      "Fresh herbs"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185707997767401552/zaicod3s_Danish_Roasted_duck_8k_Ultra-HD_6fa781a1-408e-4872-a61b-463c6be45426.png?ex=659097a0&is=657e22a0&hm=021fb6ca735acdbebab2afb05af96faf951fa5dc8a88823989b3f1728d595e38&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Denmark"
  },
  {
    "id": 6,
    "name": "Suckling Pig",
    "instructions": [
      "Ensure the pig is thoroughly cleaned and patted dry with paper towels. Remove any excess hair using a kitchen torch or by carefully shaving it off. Rinse the pig inside and out with cold water. Using a sharp knife, score the skin of the pig in a crosshatch pattern, making sure not to cut too deeply into the meat.",
      "Rub the pig generously with salt and freshly ground black pepper, both inside the cavity and all over the outside skin. You can also drizzle some olive oil or melted butter to help crisp the skin during roasting. Use kitchen twine to tie the legs and secure the pig's shape. This helps the pig cook evenly and holds it together during roasting.",
      "Preheat your oven to a high temperature, around 450°F (230°C).",
      "Place the pig on a roasting rack in a large roasting pan. Start roasting the pig at the high temperature for about 30 minutes to help crisp the skin. Then, reduce the oven temperature to 325°F (160°C) and continue roasting.",
      "Cooking time varies based on the size of the pig. A general guideline is about 30-40 minutes per pound. Use a meat thermometer to ensure the internal temperature reaches 160°F (71°C) in the thickest part of the meat. Once done, remove the pig from the oven and let it rest for about 20-30 minutes before carving."
    ],
    "ingredients": [
      "1 suckling pig",
      "Salt",
      "Freshly ground black pepper",
      "Olive oil or melted butter",
      "Herbs"
    ],
    "image_url": "https://media.discordapp.net/attachments/1046222137570119792/1185711525818814594/zaicod3s_roasted_Suckling_pig_dish_Ultra-HD_8d045646-d617-4ebb-bef4-e46a4417a543.png?ex=65909ae9&is=657e25e9&hm=a15a6a274b9be2a04e49d130a504aec36dadd41e1c83c5883a60860d121de8ba&=&format=webp&quality=lossless&width=1181&height=662",
    "country": "Germany"
  }
]
